---
kind: method
id: M:Autodesk.Revit.DB.ConfigurationReloadInfo.#ctor
source: html/eb3be872-7712-31eb-5d0a-987ed8a9b9ec.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo.#ctor Method

Constructor.

## Syntax (C#)
```csharp
public ConfigurationReloadInfo()
```